# St7GetMultiPointLinkFluxSum

Returns the reaction multi-point link flux result for thermal solvers.

long St7GetMultiPointLinkFluxSum(long uID, long LinkNum, long ResultCase,

double* Flux)

Input Parameters

uID

Strand7 model file ID.

LinkNum

Link number.

ResultCase

Result case number.

Results

Output Parameters

Flux

Flux result.